#include <iostream>
#include <cmath>// підключення бібліотеки математичних функцій
using namespace std;
//28, 16, 7
int main(){
	//Integer28.
	//Дні тижня пронумеровані наступним чином : 1 - понеділок, 2 -
	//вівторок, ..., 6 - субота, 7 - неділя.Дано ціле число K, що лежить в
	//діапазоні 1 - 365, і ціле число N, яке лежить в діапазоні 1 - 7. Визначити
	//номер дня тижня для K - го дня року, якщо відомо, що цього року 1
	//січня було днем тижня з номером N.

	// Ініціалізуємо вхідних змінні
	int var_k, var_n;
	// Ініціалізуємо вихідну змінну
	int week_day;
	
	//Запрос у користувача на ввід змінних
	cout << "Початок задачі Integer28\n";
	cout << "Введіть номер дня тижня першого січня в діапазоні 1-7\n";
	// введення данних
	cin >> var_k;
	cout << "Введіть номер дня року, щоб знайти його номер дня тижня в діапазоні 1-365\n";
	// введення данних
	cin >> var_n;
	// підрахунок
	week_day = ((var_n + var_k - 2) % 7 + 7) % 7 + 1;
	// вивід результату
	cout << "Номер дня тижня: " << week_day << endl << endl;

	//Boolean16.
	//Дано ціле додатне число.Перевірити істинність висловлювання : «Дане число є парним двозначним».

	// Ініціалізуємо вхідну змінну
	int var_number;
	// Ініціалізуємо вихідну змінну
	bool b_result;

	//Запрос у користувача на ввід змінних
	cout << "Початок задачі Boolean16\n";
	cout << "Введіть число, щоб дізнатися чи є воно парним двозначним:\n";
	// введення данних
	cin >> var_number;
	// підрахунок
	b_result = var_number > 9 && var_number < 99 && var_number % 2 == 0;
	// вивід результату
	cout << "Чи є парним додатним (1-так,0-ні): " << b_result << endl << endl;


	//Equation7

	// Ініціалізуємо вхідну змінну
	double x_number;
	// Ініціалізуємо вихідну змінну
	double result;
	// Ініціалізуємо проміжні змінні, для виконяння задачі
	double nom, denom;
	
	//Запрос у користувача на ввід змінних
	cout << "Початок задачі Equation7\n";
	cout << "Введіть x щоб знайти результат формули, згідно Equation7\n";
  // введення данних
	cin >> x_number;

	// підрахунок
	nom = (log(abs(x_number)) / log(4)) * (sqrt(abs(x_number * sin(x_number) * cos(x_number))));
	denom = cos(x_number + 32) + 0.5 * sqrt(x_number + 5);
	result = 0.5 * nom / denom;

	// вивід результату
	cout << "y =  " << result << endl;

}
