#include <iostream>
#include <cmath>
#include <Windows.h>
using namespace std;

//Variants 11 45 26

//  Proc11 Описати процедуру Minmax(X, Y), що записує в змінну X мінімальне зі
//  значень X і Y, а в змінну Y - максимальне з цих значень(X і Y - дійсні
//	параметри, які є одночасно вхідними та вихідними).Використовуючи
//	чотири виклики цієї процедури, знайти мінімальне і максимальне з
//	даних чисел A, B, C, D.
void proc_11();

//	Proc45.
//	Описати функцію LinePointDistance(x, y, A, B, C) дійсного типу,
//	яка обчислює відстань від точки(x, y) до прямої Ax + By + C = 0 за
//	формулою d = | Ax + By + C|/√(A2 + B2).За допомогою цієї функції
//	знайти відстані для трьох точок і прямих.
void proc_45();

//	Integer26.Дні тижня пронумеровані наступним чином : 1 - понеділок, 2 -
//	вівторок, ..., 6 - субота, 7 - неділя.Дано ціле число K, що лежить в
//	діапазоні 1 - 365. Визначити номер дня тижня для K - го дня року, якщо
//	відомо, що цього року 1 січня було вівторком.


int main() {
	while (true) {
		proc_11();
	}
	return 0;
}

// Функція для знаходження більшого з двох чисел X Y
// та приведення до формату X < Y
static void minmax(int& X, int& Y) {
	//якщо X > Y перетасовуємо
	if (X > Y) {
		int temp = X;
		X = Y;
		Y = temp;
	}
}

void proc_11() {
	int A, B, C, D;
	cout << "Enter four integers" << endl;
	cin >> A >> B >> C >> D;

	minmax(A, B);
	minmax(C, D);
	minmax(A, C);
	minmax(B, D);

	cout << "Min: " << A << " Max: " << D << endl;
}

void proc_45(int& x, int& y, int& A, int& B, int& C) {

}
